var blessMan ='才貌双全&逸群之才&玉树临风&温文尔雅&淑人君子&清新俊逸&品貌非凡&才貌双绝&吃苦耐劳&默默无闻&一丝不苟&精益求精&兢兢业业&孜孜不倦&恪尽职守&实事求是&求真务实&高谈阔论&眉飞色舞&运筹帷幄&言简意赅&完美无缺&远见卓识&乐善好施&助人为乐&古道热肠&雪中送炭&慷慨解囊&急公好义&乐于助人&无私奉献&出类拔萃&出神入化&万古流芳&一本正经&功德无量&力排众议&力挽狂澜&气贯长虹&气势磅礴&气吞山河&坚韧不拔&身体力行&英姿焕发&艰苦奋斗&一尘不染&一鸣惊人&叱诧风云&排山倒海&惊涛骇浪&惊心动魄&惊天动地&十全十美&无懈可击&无与伦比&励精图治&壮志凌云&持之以恒&锲而不舍&光明磊落&兢兢业业&高瞻远瞩&一丝不苟&不耻最后&乘风破浪&顶天立地&鸿鹄之志&九天揽月&夸父追日&老骤伏枥&老当益壮&力争上游&陵云之志&猛志常在&磨杵成针&铁杵成针&胸怀大志&雄飞雌伏&雄心壮志&移山倒海&迎头赶上&知难而进&抱诚守真&表里如一&全心全意&落落大方&怀珠抱玉&志在四方&中流击楫&壮志凌云&自力更生&自强不息&自求多福&仪态万方&发愤图强&奋发图强&奋发蹈厉&披荆斩棘&闻鸡起舞&自食其力';
Array.prototype.distinct = function (){
    var arr = this,
        i,
        j,
        len = arr.length;
    for(i = 0; i < len; i++){
        for(j = i + 1; j < len; j++){
            if(arr[i] == arr[j]){
                arr.splice(j,1);
                len--;
                j--;
            }
        }
    }
    return arr;
};
export default blessMan.split("&").distinct();